# GroupNode Methods

---
The GroupNode type exposes the following members.
| Name| Description
---|---|---
| Dispose| (Inherited from RenderNode)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetTransform|  A transformation matrix associated with the node.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
GroupNode Class
Autodesk.Revit.DB Namespace